import Iceter from "../src/Iceter"

window.editor = new Iceter({
  el: '#app'
})
window.editor.setContent(`
    <h1>桃花源记</h1><div>朝代：魏晋</div><div>作者：陶渊明<br></div>
    <div><hr>晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷，渔人甚异之。复前行，欲穷其林。&nbsp;</div><div><br></div><div>林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田美池桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣着，悉如外人。黄发垂髫，并怡然自乐。&nbsp;</div><div><br></div><div>见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。此中人语云：“不足为外人道也。”(间隔 一作：隔绝)&nbsp;</div><div><br></div><div>既出，得其船，便扶向路，处处志之。及郡下，诣太守，说如此。太守即遣人随其往，寻向所志，遂迷，不复得路。&nbsp;</div><div><br></div><div>南阳刘子骥，高尚士也，闻之，欣然规往。未果，寻病终，后遂无问津者。</div><h2>注释</h2><div><ul><li>穷（古义：穷尽；今义：贫穷）</li><li>从来（古义：从哪里来；今义：向来）</li><li>无论（古义：不要说，（更）不必说；今义：多为连词，表示条件不同而结果不变，不管）</li></ul></div>
    <div>##</div>
    <div>***</div>
    <div>*</div>
    <div>1.</div>
    <div>给后面的字体**加粗**</div>
    <div>给后面的字体*斜体*</div>
    <div>给后面的字体~下划线~</div>
    <div>给后面的字体~~删除线~~</div>
`)